perf-tests/test-plans/order-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  JMeter Load Test Plan: Order API
  
  HOW TO USE THIS TEST PLAN:
  
  1. Run via CLI (recommended for CI/CD):
     jmeter -n -t order-load-test.jmx \
       -Jhost=localhost -Jport=8080 \
       -Jthreads=50 -Jrampup=30 -Jduration=300 \
       -Jdata.file=../generated-data/jmeter-users.csv \
       -l results.jtl -e -o report/
  
  2. Parameters (override via -J flag):
     - host:      Target host (default: localhost)
     - port:      Target port (default: 8080)
     - threads:   Concurrent users (default: 10)
     - rampup:    Ramp-up period in seconds (default: 10)
     - duration:  Test duration in seconds (default: 60)
     - data.file: CSV file with synthetic test data
  
  3. Test Scenarios:
     a) Health Check (lightweight baseline)
     b) Create Order (write path)
     c) Get Order by ID (read path)
     d) List Orders by Customer (search path)

  HOW TO WRITE NEW JMeter SCENARIOS:
  - Add a new HTTP Sampler under the Thread Group
  - Use ${__P(param,default)} for parameterization
  - Use ${variable} for CSV data columns
  - Add assertions for each sampler
  - Group related samplers in Transaction Controllers
-->
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Order API Load Test">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- CSV Data Set - reads synthetic test data -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Synthetic Test Data">
        <stringProp name="filename">${__P(data.file,generated-data/jmeter-users.csv)}</stringProp>
        <stringProp name="variableNames">userId,email,firstName,lastName,orderId,orderTotal</stringProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <stringProp name="recycle">true</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>

      <!-- Thread Group - simulates concurrent users -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Order API Users">
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Defaults -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults">
          <stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- Header Manager -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Scenario 1: Health Check -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Health Check">
          <stringProp name="HTTPSampler.path">/actuator/health</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">8</intProp>
            <intProp name="Assertion.test_field">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- Scenario 2: Create Order -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order">
          <stringProp name="HTTPSampler.path">/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"customerId":"${userId}","items":[{"productId":"PROD-001","productName":"Load Test Widget","quantity":1,"unitPrice":${orderTotal}}]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 201">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">201</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">8</intProp>
            <intProp name="Assertion.test_field">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Extract order ID for subsequent requests -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Order ID">
            <stringProp name="JSONPostProcessor.referenceNames">createdOrderId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- Scenario 3: Get Order by ID -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Order">
          <stringProp name="HTTPSampler.path">/api/orders/${createdOrderId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">8</intProp>
            <intProp name="Assertion.test_field">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- Scenario 4: List Orders by Customer -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="List Customer Orders">
          <stringProp name="HTTPSampler.path">/api/orders?customerId=${userId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">8</intProp>
            <intProp name="Assertion.test_field">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- Aggregate Report Listener (for CLI output) -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>